[{"first_name": "Aaron", "name": "Aaron Buxbaum", "gender": "male", "age": null, "companies": [{"name": "Google", "end_date": ["May 2017 "], "years_working": "", "definiton": "Local Guides is a global program for people who share their local expertise to help make Google Maps better, so others can decide where to eat, shop, play, etc. Founder, Community Manager, and Web Developer December 2012 - Present HaloCustoms is an interface to help Halo players organize customized game lobbies. Previously, you couldn't play your own creations without having an extensive list of friends that had to be online at a convenient time. Now, thousands of people who otherwise would never have met each other can schedule their game nights and have new friends join in. The utility of HaloCustoms brings together over 20,000 dedicated members of the online Halo community to help the growth of customized and personalized solutions.", "position": "Web Developer", "start_date": ["March 2016"]}, {"name": "", "end_date": ["May 2017 "], "years_working": "", "definiton": "HaloCustoms is an interface to help Halo players organize customized game lobbies. Previously, you couldn't play your own creations without having an extensive list of friends that had to be online at a convenient time. Now, thousands of people who otherwise would never have met each other can schedule their game nights and have new friends join in. The utility of HaloCustoms brings together over 20,000 dedicated members of the online Halo community to help the growth of customized and personalized solutions.", "position": "Founder, Community Manager, and Web Developer", "start_date": ["December 2012"]}, {"name": "Raymond James Financial, Inc.", "end_date": ["March 2016"], "years_working": "5 months", "definiton": "Build out centralized Angular services and frameworks for next-gen application development", "position": "Associate Developer, Architecture & Data", "start_date": ["October 2015"]}, {"name": "", "end_date": ["2016"], "years_working": "4 years 10 months", "definiton": "Works on a small team (about 10) hand-selected Community Cartographers of well-regarded Halo fansite community leaders. The team helps game developers make level and gameplay decisions for the Halo 4 matchmaking hoppers, which then are made available for millions of players to play on every day.", "position": "Community Cartographer", "start_date": ["March 2011"]}, {"name": "FactSet Research Systems", "end_date": ["October 2015"], "years_working": "1 year 9 months", "definiton": "FactSet offers instant access to financial data and analytics to thousands of analysts, portfolio managers, and investment bankers at the world’s financial institutions. FactSet is one of FORTUNE's \"100 Best Companies to Work For\" and has been listed as one of Forbes’ “200 Best Small Companies” for 14 consecutive years. As a front-end engineer, responsible for development of Risk in Portfolio Analytics 3, built in AngularJS and HTML5. Participate in development of Thief, a company-wide set of Angular widgets for use in all nextgen applications. Communicate and delegate closely with application design, QA, product development, \fand a variety of other engineering teams to accomplish modularity and optimal results over a large body of constantly changing code. As Git administrator, ensure that source control practices are adhered to and resolve Git issues.", "position": "Software Engineer II", "start_date": ["January 2014"]}, {"name": "", "end_date": ["December 2013"], "years_working": "3 months", "definiton": "Manages website, creates new content, features, and engagement tools. Responsible for all AV connection, IT support, and Web-based traffic.", "position": "Director of AV & IT", "start_date": ["September 2013"]}, {"name": "MASS Electronic Dance Music Community (MASS EDMC)", "end_date": ["December 2013"], "years_working": "2 years 4 months", "definiton": "Work to support website development and maintenance, particularly regarding the community forum.", "position": "Tech Support", "start_date": ["August 2011"]}, {"name": "Corero Network Security", "end_date": ["September 2013"], "years_working": "4 months", "definiton": "-Assisting with various aspects of testing and automating our IPS network security products -Developing and/or enhancing test tools to improve efficiency in testing and in our development process in general -Finding software bugs and logging issues, follow-up with development on troubleshooting and problem resolutions", "position": "Software Engineering Intern", "start_date": ["May 2013"]}, {"name": "REB Research & Consulting, co.", "end_date": ["December 2011"], "years_working": "6 years 7 months", "definiton": "Design, programming, and continued maintenance of REB Research website, as well as any additional computer-related problems needed.", "position": "Web Developer", "start_date": ["May 2005"]}, {"name": "", "end_date": ["August 2011"], "years_working": "5 months", "definiton": "Created and ran an experimental forum website targeted at the artistic audience. Discouraged by the pure information-centric design of most forums, instead the website was designed to encourage the \"flow\" of a natural conversation. This was done by making wandering discussions easy to follow, while simultaneously maximizing user autonomy with self-moderation features.", "position": "Founder, Community Manager, and Web Developer", "start_date": ["March 2011"]}, {"name": "", "end_date": ["October 2010"], "years_working": "2 years 11 months", "definiton": "Run community and public relations, as well as networking out to relevant affiliated websites for contacts and collaborative events; grew website community to approx. 70,000 members.", "position": "Chief Communications Officer", "start_date": ["November 2007"]}], "education": [{"start": "2016", "end": "2017", "name": "Georgia Institute of Technology"}, {"start": "2009", "end": "2013", "name": "\fUniversity of Massachusetts, Amherst"}]}, {"first_name": "Andrew", "name": "Andrew Lee", "gender": "male", "age": null, "companies": [{"name": "Google", "end_date": ["May 2017 "], "years_working": "", "definiton": "I work on making Firebase even more awesome.", "position": "Firebase - Engineering Manager", "start_date": ["October 2014"]}, {"name": "Firebase", "end_date": ["October 2014"], "years_working": "3 years 2 months", "definiton": "I was a cofounder at Firebase until it was acquired by Google in October 2014.", "position": "Co-Founder", "start_date": ["August 2011"]}, {"name": "Envolve", "end_date": ["April 2012"], "years_working": "2 years 11 months", "definiton": "", "position": "Co-Founder", "start_date": ["May 2009"]}, {"name": "", "end_date": ["February 2010"], "years_working": "1 year 7 months", "definiton": "[Acquired by TrackItBack, a Canadian competitor] Led the technical design and implementation of the world's first free lost and found tracking service. Voted #64 in PC Magazine's top 100 products of 2009.", "position": "Co-Founder", "start_date": ["July 2008"]}, {"name": "", "end_date": ["June 2008"], "years_working": "6 months", "definiton": "Conceived and wrote a patent for secure mobile biometric authentication. Led the research and drafting of a business plan for a high security payments business. Implemented a prototype secure authentication system.", "position": "Co-Founder", "start_date": ["December 2007"]}, {"name": "Green Hills Software", "end_date": ["December 2007"], "years_working": "1 year 6 months", "definiton": "Customized Green Hills's high security and real-time software for major customers. Built device drivers. Ported client software to the INTEGRITY operating system.", "position": "Systems Software Engineer", "start_date": ["June 2006"]}, {"name": "Seagate Technology", "end_date": ["August 2005"], "years_working": "2 months", "definiton": "\fWrote MatLab software for testing the seek performance of hard drives. Designed a testing system to measure the imbalances in hard drive armatures without opening the drive.", "position": "Software Engineering Intern", "start_date": ["June 2005"]}, {"name": "Adobe Systems", "end_date": ["August 2004"], "years_working": "2 months", "definiton": "Worked on the PDF export functionality of Photoshop CS3", "position": "Software Engineering Intern", "start_date": ["June 2004"]}, {"name": "", "end_date": ["August 2003"], "years_working": "2 months", "definiton": "Tested medical sales software on mobile devices and on the web.", "position": "Software Testing Intern", "start_date": ["June 2003"]}], "education": [{"start": "2002", "end": "2006", "name": "Rose-Hulman Institute of Technology"}]}]